<pre>
<?

///////////////////////////////////////////////////////(1)
$a1=array(1,2,3,4,5,6,7,8,9,10);
    print_r($a1);

$a2=array_map(function($x){return $x*$x;},$a1);
print_r($a2);
///////////////////////////////////////////////////////(1)

///////////////////////////////////////////////////////(2)
function square($a){
    return $a*$a;
}


function my_array_map($fan,$array){
    foreach($array as $v){
       $k[]=$fan($v);
    }
    return $k;
}

print_r(my_array_map("square",$a1));

///////////////////////////////////////////////////////(2)
//1 и 2 это одно и тоже!!!!  

?>
</pre>